---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecRoomLightingCalcWorkplane
source: html/6fc185de-b9fc-bff7-ff30-9f52e0c15f15.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecRoomLightingCalcWorkplane Property

"Lighting Calculation Workplane"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecRoomLightingCalcWorkplane { get; }
```